eisup_2019_docmng_integration/src/Catalogs/абс_МодулиДляВыполнения/абс_МодулиДляВыполнения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>абс_МодулиДляВыполнения</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ChangeStatusAct</name>
      <description>Change status act</description>
    </items>
    <items>
      <name>ChangeStatusDogovor</name>
      <description>Change Status Dogovor</description>
    </items>
    <items>
      <name>CreateAct</name>
      <description>Create act</description>
    </items>
    <items>
      <name>CreateDogovor</name>
      <description>Create dogovor</description>
    </items>
  </predefined>
  <attributes>
    <name>ТекстМодуля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВыполнения</name>
    <type>
      <types>EnumRef.абс_ВидыВыполненияМодулей</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ПоследнийИзменивший</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРегламентноеЗадание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегламентноеЗаданиеGUID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Параметры</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>75</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПараметра</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоВыражение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Запросы</name>
    <attributes>
      <name>ИмяЗапроса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>75</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстЗапроса</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Enums/абс_ВидыВыполненияМодулей/абс_ВидыВыполненияМодулей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ВидыВыполненияМодулей</name>
  <enumValues>
    <name>НаКлиенте</name>
  </enumValues>
  <enumValues>
    <name>НаСервере</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Catalogs/абс_МодулиДляВыполнения/ObjectModule.bsl
Процедура ВыполнитьМодуль(СтруктураПараметров = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	Если СтруктураПараметров = Неопределено Тогда
		СтруктураПараметров = ПолучитьСтруктуруПараметров();
	КонецЕсли;
	
	Если СтруктураПараметров = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ЗаписьЖурналаРегистрации("Выполнение модулей", УровеньЖурналаРегистрации.Информация, , , "Запущен модуль " + СокрЛП(Код) + ".");
		
	ТекстыЗапросов = Неопределено;
	
	Попытка 
		ТекстыЗапросов = ПолучитьСтруктуруТекстовЗапросов();
	Исключение
		Сообщить("Ошибка при заполнении структуры запросов:" + Символы.ПС + ОписаниеОшибки());		
	КонецПопытки;
	
	Если ВидВыполнения = Перечисления.абс_ВидыВыполненияМодулей.НаСервере Тогда
		
		абс_СерверныеФункции.ВыполнитьКодНаСервере(ТекстМодуля, СтруктураПараметров, ТекстыЗапросов, ДопПараметры);
		
	Иначе
		
		ВыполнитьКодНаКлиенте(ТекстМодуля, СтруктураПараметров, ТекстыЗапросов, ДопПараметры);
		
	КонецЕсли;
	
	ЗаполнитьТаблицуПараметров(СтруктураПараметров);
	
	ЗаписьЖурналаРегистрации("Выполнение модулей", УровеньЖурналаРегистрации.Информация, , , "Выполнен модуль " + СокрЛП(Код) + ".");
	
КонецПроцедуры

Функция ЗаполнитьТаблицуПараметров(СтруктураПараметров)
	
	Если СтруктураПараметров.Количество() > 0 Тогда
		Параметры.Очистить();
		Для Каждого Элемент Из СтруктураПараметров Цикл
			НоваяСтрока = Параметры.Добавить();	
			НоваяСтрока.ИмяПараметра = Элемент.Ключ;
			НоваяСтрока.ЗначениеПараметра = Элемент.Значение;
		КонецЦикла;	
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСтруктуруТекстовЗапросов(Отказ = Ложь) Экспорт
	
	СтруктураТекстовЗапросов = Новый Структура;
	
	Для Каждого СтрокаЗапрос Из Запросы Цикл
		
		СтруктураТекстовЗапросов.Вставить(СтрокаЗапрос.ИмяЗапроса, СтрокаЗапрос.ТекстЗапроса);
		
	КонецЦикла;
	
	Возврат СтруктураТекстовЗапросов;
	
КонецФункции

Функция ПолучитьСтруктуруПараметров(Отказ = Ложь) Экспорт
	
	СтруктураПараметров = Новый Структура;
	
	Для Каждого СтрокаПараметра Из Параметры Цикл
		
		Попытка 
			
			СтруктураПараметров.Вставить(СтрокаПараметра.ИмяПараметра, СтрокаПараметра.ЗначениеПараметра);
			
		Исключение
			
			Отказ = Истина;
			Сообщить("Ошибка при установке параметра № " + СтрокаПараметра.НомерСтроки + ": " + СтрокаПараметра.ИмяПараметра + "");
			
		КонецПопытки;
		
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат СтруктураПараметров;
	
КонецФункции

Функция ПолучитьТаблицуПараметров(Отказ = Ложь) Экспорт
	
	ТаблицаПараметров = Новый ТаблицаЗначений;
	ТаблицаПараметров.Колонки.Добавить("ИмяПараметра");
	ТаблицаПараметров.Колонки.Добавить("ЭтоВыражение");
	ТаблицаПараметров.Колонки.Добавить("ЗначениеПараметра");
	
	Для Каждого СтрокаПараметраМодуля Из Параметры Цикл
		
		ЗаполнитьЗначенияСвойств(ТаблицаПараметров.Добавить(), СтрокаПараметраМодуля);
		
	КонецЦикла;
	
	Возврат ТаблицаПараметров;
	
КонецФункции


Процедура ВыполнитьКодНаКлиенте(ТекстМодуля, СтруктураПараметров = Неопределено, СтруктураЗапросов = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	Выполнить(ТекстМодуля);
	
КонецПроцедуры
   
Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЭтоГруппа и Модифицированность() Тогда
		абс_ПоследнийИзменивший = глЗначениеПеременной("глТекущийПользователь");
	КонецЕсли;
	
КонецПроцедуры
